{
   "allow_add_mods" : true,
   "custom_icons" : true,
   "description" : "[h1]Fast Logic [/h1]\r\nWith great optimization, comes great speed. Fast logic provides significant acceleration compared to vanilla logic gates and makes the use of logic for practical purposes much more viable.\r\n[list]\r\n[*][b]Fast Logic Gate[/b]\r\nBehaves just like a vanilla logic gate, until you hover over it and press U. This will significantly increase the speed at which your logic runs. On top of this, fast logic gates allow you to change the color of their connection dot with the help of the multitool.\r\n[*][b]Single Tick Step Button[/b]\r\nThis button can be used to stop the simulation of Fast Logic. When pressing it the first time the simulation speed will be set to 0. Every time you press it after that it will step the simulation one tick. This is useful when debugging a creation because you can see exactly what happens on every tick.\r\n[*][b]End Tick Button[/b]\r\nThis block is used to end the current simulation tick. By powering it by with a logic input it makes the creation only run one more simulation tick till the next game tick. This can be used to automatically synchronize displays to the tickspeed of the game.\r\n[/list]\r\n\r\n[h1]Silicon[/h1]\r\nLogic gates cause lag due to their existence, the calculation of physics, and the updating of logic states. The solution to this is to consolidate cuboids of logic into \"silicon\" blocks, which internally store all the data that the logic gates inside would have had and behave exactly the same. These silicon blocks are much better for game performance. A side effect of consolidating blocks together is that we can perform data compression on the logic blocks stored inside the silicon blocks, leading to significantly smaller file sizes. This means you can save much larger logic creations on your lift without needing to worry about spawning them.\r\n\r\n[h1]Multitool[/h1]\r\nThe multitool is a new tool that allows players to easily manipulate logic efficiently. It has functions that work with the rest of the mod such as converting to fast logic or silicon and colorizing the fast logic connection dots. It also has functions that let you quickly and effortlessly manufacture logic by creating large amounts of connections quickly. Many tools allow you to shorten the time it takes to create logic from hours to minutes. On top of that, many helper tools are present that allow you to debug your logic quickly.",
   "fileId" : 3100500975,
   "localId" : "5e308f63-63d3-46b6-adf2-f8ebfc976f4d",
   "name" : "MT Fast Logic",
   "type" : "Blocks and Parts",
   "version" : 1
}
